app/controllers/api/authentication_controller.rb

      def login
        @user = Player.find_by(username: params[:username])
---
SELECT `players`.* FROM `players` WHERE `players`.`username` = 'hoanganh' LIMIT 1