app/controllers/api/games_controller.rb

SELECT `players`.* FROM `players`
INSERT INTO `players` (`created_at`, `updated_at`) VALUES ('2021-01-12 05:02:19.663442', '2021-01-12 05:02:19.663442')
INSERT INTO `games` (`created_at`, `updated_at`, `player1`, `player2`, `winner`, `status`) VALUES ('2021-01-12 16:51:08.326685', '2021-01-12 16:51:08.326685', 5, 6, 0, TRUE)
INSERT INTO `logs` (`point1`, `point2`, `created_at`, `updated_at`, `gameid`, `status`) VALUES (0, 0, '2021-01-12 16:51:08.352003', '2021-01-12 16:51:08.352003', 13, TRUE)
INSERT INTO `logs` (`point1`, `point2`, `created_at`, `updated_at`, `gameid`) VALUES (0, 0, '2021-01-12 07:46:06.055790', '2021-01-12 07:46:06.055790', 7)
INSERT INTO `games` (`created_at`, `updated_at`, `player1`, `player2`, `winner`, `status`) VALUES ('2021-01-12 07:27:58.433264', '2021-01-12 07:27:58.433264', 3, 4, 0, TRUE)
---
        def create
            players = params[:players]
            player1 = players["A"]
            player2 = players["B"]
            if !Player.exists?(id: player1) || !Player.exists?(id: player2)
                render json: {message: "Player's id invalid"}
            else
                game = Game.create(player1: player1, player2: player2, winner: 0, status: 1)
                if game.save
                    log = Log.create(point1: 0, point2: 0, gameid: game.id, status: true)
                    log.save

SELECT `games`.* FROM `games` WHERE `games`.`id` = 14 LIMIT 1
---
        def score
            playerId = params[:player_id]
            gameId = params[:gameid]
            gameModel = Game.find_by(id: gameId)

SELECT `games`.* FROM `games` WHERE `games`.`id` = 13 LIMIT 1
SELECT `players`.* FROM `players` WHERE `players`.`id` = 5 LIMIT 1
SELECT `players`.* FROM `players` WHERE `players`.`id` = 3 LIMIT 1
---
        def reset_point
            game_id = params[:gameid]
            player_id = params[:player_id]
            game_model = Game.find_by(id: game_id, status: true)
            if !game_model.nil?

                player = nil
                nice = 0
                if game_model.player1 == player_id
                    player = Player.find(player_id)
                    nice = 1
                elsif game_model.player2 == player_id
                    player = Player.find(player_id)

SELECT `games`.* FROM `games` WHERE `games`.`id` = 14 AND `games`.`status` = TRUE LIMIT 1
SELECT `logs`.* FROM `logs` WHERE `logs`.`gameid` = 14 AND `logs`.`status` = TRUE LIMIT 1
UPDATE `games` SET `games`.`updated_at` = '2021-01-12 15:58:01.988749', `games`.`winner` = 4, `games`.`status` = FALSE WHERE `games`.`id` = 7
UPDATE `logs` SET `logs`.`updated_at` = '2021-01-12 23:54:39.610644', `logs`.`status` = FALSE WHERE `logs`.`id` = 31
---
        def end_game
            game_id = params[:gameid]
            game_model = Game.find_by(id: game_id, status: true)
            if !game_model.nil?
                log_model = Log.find_by(gameid: game_id, status: true)
                if log_model.point1 > log_model.point2
                    update_count(game_model.player1, game_model.player2, game_model)
                elsif log_model.point1 < log_model.point2
                    update_count(game_model.player2, game_model.player1, game_model)
                end
                log_model.update(status: false)

SELECT `games`.* FROM `games` WHERE `games`.`id` = 14 LIMIT 1
---
        def show
            game_id = params[:id]
            game_model = Game.find_by(id: game_id)

SELECT `players`.* FROM `players`
---
        def leaderboard
            players = Player.all

SELECT `players`.* FROM `players` WHERE `players`.`id` = 5 LIMIT 1
UPDATE `players` SET `players`.`point` = 50, `players`.`updated_at` = '2021-01-12 23:53:54.415228' WHERE `players`.`id` = 5
SELECT `logs`.* FROM `logs` WHERE `logs`.`status` = TRUE AND `logs`.`gameid` = 14 LIMIT 1
INSERT INTO `logs` (`point1`, `point2`, `created_at`, `updated_at`, `gameid`, `status`) VALUES (40, 40, '2021-01-12 23:53:54.442785', '2021-01-12 23:53:54.442785', 14, TRUE)
INSERT INTO `logs` (`point1`, `point2`, `created_at`, `updated_at`, `gameid`, `status`) VALUES (10, 40, '2021-01-12 23:40:40.649736', '2021-01-12 23:40:40.649736', 14, TRUE)
UPDATE `logs` SET `logs`.`updated_at` = '2021-01-12 11:27:52.850877', `logs`.`status` = TRUE WHERE `logs`.`id` = 13
INSERT INTO `logs` (`point1`, `point2`, `created_at`, `updated_at`, `gameid`, `status`) VALUES (0, 10, '2021-01-12 23:27:17.394013', '2021-01-12 23:27:17.394013', 14, TRUE)
UPDATE `logs` SET `logs`.`updated_at` = '2021-01-12 23:53:54.451254', `logs`.`status` = FALSE WHERE `logs`.`id` = 29
---
        def update_point_score(playerId, gameModel)
            player = Player.find(playerId)
            player.update(point: player.point+10)
            lastestLog = Log.find_by(status: true, gameid: gameModel.id)
            log = nil
            flag = 0
            if playerId == gameModel.player1
                log = Log.create(point1: lastestLog.point1 + 10, point2: lastestLog.point2, gameid: gameModel.id, status: true)
                flag = 1
            elsif playerId == gameModel.player2
                log = Log.create(point1: lastestLog.point1, point2: lastestLog.point2 + 10, gameid: gameModel.id, status: true)
                flag = 1
            end
            if flag
                log.save
                lastestLog.update(status: false)

UPDATE `players` SET `players`.`point` = 10, `players`.`updated_at` = '2021-01-12 16:57:03.744076' WHERE `players`.`id` = 5
SELECT `logs`.* FROM `logs` ORDER BY created_at DESC LIMIT 2
DELETE FROM `logs` WHERE `logs`.`id` = 21
UPDATE `logs` SET `logs`.`updated_at` = '2021-01-12 16:57:03.783387', `logs`.`status` = TRUE WHERE `logs`.`id` = 20
---
        def destroy_update(player)
            player.update(point: player.point - 10)
            log_models = Log.order('created_at DESC').limit(2)
            log_model1 = log_models[0]
            log_model2 = log_models[1]
            log_model1.destroy
            log_model2.update(status: true)

UPDATE `games` SET `games`.`updated_at` = '2021-01-12 23:54:39.577555', `games`.`winner` = 5, `games`.`status` = FALSE WHERE `games`.`id` = 14
SELECT `players`.* FROM `players` WHERE `players`.`id` = 5 LIMIT 1
SELECT `players`.* FROM `players` WHERE `players`.`id` = 6 LIMIT 1
UPDATE `players` SET `players`.`wincount` = 2, `players`.`updated_at` = '2021-01-12 23:54:39.590838' WHERE `players`.`id` = 5
UPDATE `players` SET `players`.`losecount` = 2, `players`.`updated_at` = '2021-01-12 23:54:39.599116' WHERE `players`.`id` = 6
---
        def update_count(win_id, lose_id, game_model)
            game_model.update(status: false, winner: win_id)
            player1 = Player.find(win_id)
            player2 = Player.find(lose_id)
            player1.update(wincount: player1.wincount + 1)
            player2.update(losecount: player2.losecount + 1)

SELECT `players`.* FROM `players` WHERE `players`.`id` = 5 LIMIT 1
SELECT `players`.* FROM `players` WHERE `players`.`id` = 6 LIMIT 1
SELECT `logs`.* FROM `logs` ORDER BY created_at DESC LIMIT 1
SELECT `logs`.* FROM `logs` WHERE `logs`.`id` = 30 LIMIT 1
---
        def to_show(id1, id2, id, winner, for_player)
            player1 = Player.find(id1)
            player2 = Player.find(id2)
            player_1 = Hash.new
            player_1.store("id", id1)
            if !for_player
                lastestLog = Log.order('created_at DESC').limit(1)[0]
                player_1.store("points", lastestLog.point1)
            else
                log_model = Log.find(id)
                player_1.store("points", log_model.point1)
            end
            player_2 = Hash.new
            player_2.store("id", id2)
            if !for_player
                lastestLog = Log.order('created_at DESC').limit(1)[0]
                player_2.store("points", lastestLog.point2)
            else
                log_model = Log.find(id)