app/controllers/api/players_controller.rb

        def index
            players = Player.all
            player_show = Array.new
            for player in players
                hash = to_show(player)
                player_show.push(hash)
---
SELECT `players`.* FROM `players` ORDER BY created_at DESC
INSERT INTO `players` (`fullname`, `username`, `password`, `point`, `wincount`, `losecount`, `status`, `created_at`, `updated_at`) VALUES ('Hoang Anh', 'Hoang Anh', '123456', 0, 0, 0, FALSE, '2021-01-12 06:58:58.688322', '2021-01-12 06:58:58.688322')

        def create
            player = Player.new(player_params)
            if player.save
---
INSERT INTO `players` (`fullname`, `username`, `password`, `point`, `wincount`, `losecount`, `status`, `created_at`, `updated_at`) VALUES ('Hoang Anh', 'Hoang Anh', '123456', 0, 0, 0, FALSE, '2021-01-12 06:58:58.688322', '2021-01-12 06:58:58.688322')

        def show
            player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1

        def update
            player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1

        def destroy
            player = Player.find(params[:id])
            player.destroy
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1
DELETE FROM `players` WHERE `players`.`id` = 1